//Завдання з лабораторної роботи №3
//З клавіатури ввести набір даних з інформацією про результати технічного огляду автомобілів:
//<Номер автомобіля>, <Марка>, <Власник>, <Несправності>.Роздрукувати введений список в абетковому порядку.
//Визначити, автомобілів якої марки найбільше в списку техогляду.

#include "Lab_6.h"

extern int kst;
static int stop = 0;

int main()
{
	system("chcp 1251");
	Cars car[N] = { 0 };
	GetList(car, &stop);
	if (kst) 
	{
		QuickSort(car, car + kst - 1);
		Results(car);
		Top(car);
	}
	else {
		printf("\n\n\t\t\t\tВи не ввели жодного даного!\n\n");
	}
	return 0;
}